# AVAs

## AVA Centroids

I created a CSV file from the latest AVA list, where multiples are seperated by
'|'.

#+BEGIN_EXAMPLE

#+END_SRC
quinn=# \d ava_list
   Table "public.ava_list"
  Column  | Type | Modifiers
----------+------+-----------
 cfr      | text | not null
 state    | text |
 name     | text |
 county   | text |
 within   | text |
 contains | text |
#+END_EXAMPLE

  cfr  | state |              name               |         county         |         within          | contains
-------+-------+---------------------------------+------------------------+-------------------------+----------
 9.232 | CA    | Big Valley District-Lake County | Lake                   | Clear Lake|North Coast  |
 9.196 | CA    | Borden Ranch                    | Sacramento|San Joaquin | Lodi                    |
 9.37  | CA    | California Shenandoah Valley    | Amador|El Dorado       | Sierra Foothills        |
 9.209 | CA    | Calistoga                       | Napa                   | Napa Valley|North Coast |
 9.176 | CA    | Capay Valley                    | Yolo                   |                         |


I uploaded the national counties (countyp020), and will just use them to locate the AVAs

#+BEGIN_EXAMPLE
create temp table ava_centroid as
with c as (
 select state,st_asewkt(st_centroid(st_union(boundary))) as centroid,
 regexp_replace(county,E' [^ ]+$','') as county
 from county group by state,county
),
s as (
 select state,st_centroid(st_union(centroid)) as centroid
from c group by state
),
a as (
 select name,
regexp_split_to_table(coalesce(county,''),'\|') as county,
regexp_split_to_table(state,'\|') as state from ava_list
),
t as (
 select name,st_centroid(st_union(c.centroid)) as county,
 st_centroid(st_union(s.centroid)) as state
 from a join s using (state)
left join c using (state,county)
group by 1 order by 2
)
select name,coalesce(county,state) as centroid
from t;
#+END_EXAMPLE

Then I created the avas from the centroids and the list, and the original shape
for Coombsville.

#+BEGIN_SRC postgres
create table avas as
select name,cfr,a.state,a.county,within,contains,
(coalesce(st_setsrid(geom,4269),centroid)) as boundary
from ava_list a left join napa_shape using (name) left join ava_centroid using (name);
#+END_SRC


## Github Issues

The source for the definitive list of AVA's is [[https://www.ttb.gov/wine/ava.shtml][TTBs]].  This includes a[[https://www.ttb.gov/appellation/us_by_ava.pdf][ PDF]] file
that can be mined for a database of all the information.

This is an example of setting an issue in your github repo.  The examples
below use authentication in your .netrc file.

#+BEGIN_SRC bash :results verbatim
http POST https://api.github.com/repos/UCDavisLibrary/ava/issues \
title=test body="#This is a test\nHope it works"
#+END_SRC


 #+BEGIN_SRC bash :results verbatim
http GET https://api.github.com/issues
 #+END_SRC

 #+RESULTS:
 #+begin_example
 [
	 {
		 "url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/12",
		 "repository_url": "https://api.github.com/repos/ucd-library/wine-label-app",
		 "labels_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/12/labels{/name}",
		 "comments_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/12/comments",
		 "events_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/12/events",
		 "html_url": "https://github.com/ucd-library/wine-label-app/issues/12",
		 "id": 200167035,
		 "number": 12,
		 "title": "Add sidebar with faceted search parameters",
		 "user": {
			 "login": "pablodefendini",
			 "id": 1683027,
			 "avatar_url": "https://avatars3.githubusercontent.com/u/1683027?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/pablodefendini",
			 "html_url": "https://github.com/pablodefendini",
			 "followers_url": "https://api.github.com/users/pablodefendini/followers",
			 "following_url": "https://api.github.com/users/pablodefendini/following{/other_user}",
			 "gists_url": "https://api.github.com/users/pablodefendini/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/pablodefendini/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/pablodefendini/subscriptions",
			 "organizations_url": "https://api.github.com/users/pablodefendini/orgs",
			 "repos_url": "https://api.github.com/users/pablodefendini/repos",
			 "events_url": "https://api.github.com/users/pablodefendini/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/pablodefendini/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [

		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 1,
		 "created_at": "2017-01-11T18:09:08Z",
		 "updated_at": "2017-02-14T17:16:58Z",
		 "closed_at": null,
		 "repository": {
			 "id": 65988039,
			 "name": "wine-label-app",
			 "full_name": "ucd-library/wine-label-app",
			 "owner": {
				 "login": "ucd-library",
				 "id": 25853352,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/25853352?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/ucd-library",
				 "html_url": "https://github.com/ucd-library",
				 "followers_url": "https://api.github.com/users/ucd-library/followers",
				 "following_url": "https://api.github.com/users/ucd-library/following{/other_user}",
				 "gists_url": "https://api.github.com/users/ucd-library/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/ucd-library/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/ucd-library/subscriptions",
				 "organizations_url": "https://api.github.com/users/ucd-library/orgs",
				 "repos_url": "https://api.github.com/users/ucd-library/repos",
				 "events_url": "https://api.github.com/users/ucd-library/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/ucd-library/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": false,
			 "html_url": "https://github.com/ucd-library/wine-label-app",
			 "description": "This is an example application to show components of a wine label.",
			 "fork": false,
			 "url": "https://api.github.com/repos/ucd-library/wine-label-app",
			 "forks_url": "https://api.github.com/repos/ucd-library/wine-label-app/forks",
			 "keys_url": "https://api.github.com/repos/ucd-library/wine-label-app/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/ucd-library/wine-label-app/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/ucd-library/wine-label-app/teams",
			 "hooks_url": "https://api.github.com/repos/ucd-library/wine-label-app/hooks",
			 "issue_events_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/ucd-library/wine-label-app/events",
			 "assignees_url": "https://api.github.com/repos/ucd-library/wine-label-app/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/ucd-library/wine-label-app/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/ucd-library/wine-label-app/tags",
			 "blobs_url": "https://api.github.com/repos/ucd-library/wine-label-app/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/ucd-library/wine-label-app/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/ucd-library/wine-label-app/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/ucd-library/wine-label-app/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/ucd-library/wine-label-app/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/ucd-library/wine-label-app/languages",
			 "stargazers_url": "https://api.github.com/repos/ucd-library/wine-label-app/stargazers",
			 "contributors_url": "https://api.github.com/repos/ucd-library/wine-label-app/contributors",
			 "subscribers_url": "https://api.github.com/repos/ucd-library/wine-label-app/subscribers",
			 "subscription_url": "https://api.github.com/repos/ucd-library/wine-label-app/subscription",
			 "commits_url": "https://api.github.com/repos/ucd-library/wine-label-app/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/ucd-library/wine-label-app/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/ucd-library/wine-label-app/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/ucd-library/wine-label-app/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/ucd-library/wine-label-app/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/ucd-library/wine-label-app/merges",
			 "archive_url": "https://api.github.com/repos/ucd-library/wine-label-app/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/ucd-library/wine-label-app/downloads",
			 "issues_url": "https://api.github.com/repos/ucd-library/wine-label-app/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/ucd-library/wine-label-app/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/ucd-library/wine-label-app/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/ucd-library/wine-label-app/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/ucd-library/wine-label-app/labels{/name}",
			 "releases_url": "https://api.github.com/repos/ucd-library/wine-label-app/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/ucd-library/wine-label-app/deployments",
			 "created_at": "2016-08-18T10:22:46Z",
			 "updated_at": "2017-02-23T01:02:31Z",
			 "pushed_at": "2017-02-22T02:59:58Z",
			 "git_url": "git://github.com/ucd-library/wine-label-app.git",
			 "ssh_url": "git@github.com:ucd-library/wine-label-app.git",
			 "clone_url": "https://github.com/ucd-library/wine-label-app.git",
			 "svn_url": "https://github.com/ucd-library/wine-label-app",
			 "homepage": null,
			 "size": 11844,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": "HTML",
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": true,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 5,
			 "forks": 0,
			 "open_issues": 5,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "Add the appropriate fields for the faceted search parameters detailed in the  [price browser prototype](https://invis.io/T89R5Y4CV#/211430469_Inital):\r\n- [ ] Region Picker\r\n- [ ] Type picker\r\n- [ ] Vintage slider\r\n- [ ] Year sold slider\r\n- [ ] Size picker"
	 },
	 {
		 "url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/3",
		 "repository_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api",
		 "labels_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/3/labels{/name}",
		 "comments_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/3/comments",
		 "events_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/3/events",
		 "html_url": "https://github.com/UCDavisLibrary/wine-price-api/issues/3",
		 "id": 196477457,
		 "number": 3,
		 "title": "Develop a crowd-source workflow",
		 "user": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [

		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 0,
		 "created_at": "2016-12-19T17:43:38Z",
		 "updated_at": "2016-12-19T20:14:32Z",
		 "closed_at": null,
		 "repository": {
			 "id": 76695011,
			 "name": "wine-price-api",
			 "full_name": "UCDavisLibrary/wine-price-api",
			 "owner": {
				 "login": "UCDavisLibrary",
				 "id": 16706829,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/16706829?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/UCDavisLibrary",
				 "html_url": "https://github.com/UCDavisLibrary",
				 "followers_url": "https://api.github.com/users/UCDavisLibrary/followers",
				 "following_url": "https://api.github.com/users/UCDavisLibrary/following{/other_user}",
				 "gists_url": "https://api.github.com/users/UCDavisLibrary/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/UCDavisLibrary/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/UCDavisLibrary/subscriptions",
				 "organizations_url": "https://api.github.com/users/UCDavisLibrary/orgs",
				 "repos_url": "https://api.github.com/users/UCDavisLibrary/repos",
				 "events_url": "https://api.github.com/users/UCDavisLibrary/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/UCDavisLibrary/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": false,
			 "html_url": "https://github.com/UCDavisLibrary/wine-price-api",
			 "description": "First pass at a wine price data api",
			 "fork": false,
			 "url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api",
			 "forks_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/forks",
			 "keys_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/teams",
			 "hooks_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/hooks",
			 "issue_events_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/events",
			 "assignees_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/tags",
			 "blobs_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/languages",
			 "stargazers_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/stargazers",
			 "contributors_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/contributors",
			 "subscribers_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/subscribers",
			 "subscription_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/subscription",
			 "commits_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/merges",
			 "archive_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/downloads",
			 "issues_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/labels{/name}",
			 "releases_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/UCDavisLibrary/wine-price-api/deployments",
			 "created_at": "2016-12-17T00:32:34Z",
			 "updated_at": "2017-02-28T18:31:01Z",
			 "pushed_at": "2017-03-17T17:56:54Z",
			 "git_url": "git://github.com/UCDavisLibrary/wine-price-api.git",
			 "ssh_url": "git@github.com:UCDavisLibrary/wine-price-api.git",
			 "clone_url": "https://github.com/UCDavisLibrary/wine-price-api.git",
			 "svn_url": "https://github.com/UCDavisLibrary/wine-price-api",
			 "homepage": null,
			 "size": 41514,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": "JavaScript",
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": false,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 6,
			 "forks": 0,
			 "open_issues": 6,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "Implement a crowd sourced workflow is a simple method, that eliminates as much as possible, multiple items being marked up, that allows curation to happen to the most important items, and to allow curated items to leave the system \r\n\r\n# Typical Workflow\r\n\r\nThe typical workflow is that a user will choose to add wine prices.  They will be given a page with potential wine prices located.  They will click on the image, and add in a single wine price entry.  They will add as many as they like.  If they feel like they've completed the pages, they can say that page is completed.  They can move to new pages, but not to pages that are verified as complete, or pages they've identified as complete.\r\n\r\nDuring their editing, they will also see other price items on the page.  These items will either be verified as good, or be still awaiting verification.  If the user was not the one that created the item, they will can verify items as good or not.  If they are not good, the user has the opportunity to edit the existing entry.\r\n\r\nIf a page is marked as completed, they have the opportunity to verify the page is complete as well.\r\n\r\n## Wine Price Items\r\n\r\nA page will have multiple wine prices items.  User's can add and verify wine prices.\r\n\r\n### Add\r\n\r\nUsers will click on a single  location within an image source.  From this location, they will be able to add in all the information for that single wine price in a simple table.  The wine price information matches the information found in #2.  \r\n\r\n### Delete\r\n\r\nUsers will only be able to delete a wine price if they created it, and it hasn't been accepted by another user.  Administrative users can delete any wine-price-item. \r\n\r\n### Verify\r\n\r\nIf an item has been added by a different user, this user may verify that the mark is correct, or incorrect.  If the mark is incorrect, the user can update the entry for that particular item.  \r\n\r\n## Page Actions\r\n\r\nEach source  will be divided into a number of pages.  These correspond to individual images, and not necessarily physical pages, but usually.  User's can identify pages as being complete, and they can verify pages as being complete or not.\r\n\r\n### Mark as Complete\r\n\r\nAny user can mark a page as completed.  Once a page is marked as completed, it is no longer shown to that user.  Other users will see that page until it has been verified as completed.  \r\n\r\n### Verify as (Un) Complete\r\n\r\nAny (authenticated) user can comment on a page's completion status, as long as they didn't identify the page as completed originally.  \r\n\r\nIF ((two) other users verify the page as complete, it will be marked as complete, and not shown to anyone but administrators\r\n\r\nAn Admin can mark any page as (un)completed and it will immediately assume that role.\r\n\r\n# Authentication\r\n\r\nIn the above scenarios we have identified \"users\", however, the application does not require that users are logged in to participate.  We have the following types of users:\r\n\r\n* Unauthenticated users - When a user first access the site, they will be assigned a persistent access token. This token will be used track the additions, and verification steps that they used, and allow for above authorizations; (like deleting existing entries, etc.)\r\n\r\n* Users will also have the opportunity to log into the application.  When they do their user id will be associated with the\r\n\r\n* Logged in users will be able to also get elevated rights.  Originally, we will only have administrative rights, but this may be modified to allow users to build elevated rights based on trust they've gained from previous interactions.\r\n\r\n\r\n\r\n\r\n"
	 },
	 {
		 "url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/12",
		 "repository_url": "https://api.github.com/repos/CSTARS/cimis-mobile",
		 "labels_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/12/labels{/name}",
		 "comments_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/12/comments",
		 "events_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/12/events",
		 "html_url": "https://github.com/CSTARS/cimis-mobile/issues/12",
		 "id": 194729752,
		 "number": 12,
		 "title": "Add station data to Ring Buffer",
		 "user": {
			 "login": "jrmerz",
			 "id": 1852393,
			 "avatar_url": "https://avatars3.githubusercontent.com/u/1852393?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/jrmerz",
			 "html_url": "https://github.com/jrmerz",
			 "followers_url": "https://api.github.com/users/jrmerz/followers",
			 "following_url": "https://api.github.com/users/jrmerz/following{/other_user}",
			 "gists_url": "https://api.github.com/users/jrmerz/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/jrmerz/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/jrmerz/subscriptions",
			 "organizations_url": "https://api.github.com/users/jrmerz/orgs",
			 "repos_url": "https://api.github.com/users/jrmerz/repos",
			 "events_url": "https://api.github.com/users/jrmerz/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/jrmerz/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [
			 {
				 "id": 121357334,
				 "url": "https://api.github.com/repos/CSTARS/cimis-mobile/labels/enhancement",
				 "name": "enhancement",
				 "color": "84b6eb",
				 "default": true
			 }
		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 },
			 {
				 "login": "jrmerz",
				 "id": 1852393,
				 "avatar_url": "https://avatars3.githubusercontent.com/u/1852393?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/jrmerz",
				 "html_url": "https://github.com/jrmerz",
				 "followers_url": "https://api.github.com/users/jrmerz/followers",
				 "following_url": "https://api.github.com/users/jrmerz/following{/other_user}",
				 "gists_url": "https://api.github.com/users/jrmerz/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/jrmerz/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/jrmerz/subscriptions",
				 "organizations_url": "https://api.github.com/users/jrmerz/orgs",
				 "repos_url": "https://api.github.com/users/jrmerz/repos",
				 "events_url": "https://api.github.com/users/jrmerz/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/jrmerz/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 1,
		 "created_at": "2016-12-10T00:31:33Z",
		 "updated_at": "2017-01-20T22:01:24Z",
		 "closed_at": null,
		 "repository": {
			 "id": 22883362,
			 "name": "cimis-mobile",
			 "full_name": "CSTARS/cimis-mobile",
			 "owner": {
				 "login": "CSTARS",
				 "id": 3672045,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/3672045?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/CSTARS",
				 "html_url": "https://github.com/CSTARS",
				 "followers_url": "https://api.github.com/users/CSTARS/followers",
				 "following_url": "https://api.github.com/users/CSTARS/following{/other_user}",
				 "gists_url": "https://api.github.com/users/CSTARS/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/CSTARS/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/CSTARS/subscriptions",
				 "organizations_url": "https://api.github.com/users/CSTARS/orgs",
				 "repos_url": "https://api.github.com/users/CSTARS/repos",
				 "events_url": "https://api.github.com/users/CSTARS/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/CSTARS/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": false,
			 "html_url": "https://github.com/CSTARS/cimis-mobile",
			 "description": "DWR Sample Mobile App",
			 "fork": false,
			 "url": "https://api.github.com/repos/CSTARS/cimis-mobile",
			 "forks_url": "https://api.github.com/repos/CSTARS/cimis-mobile/forks",
			 "keys_url": "https://api.github.com/repos/CSTARS/cimis-mobile/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/CSTARS/cimis-mobile/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/CSTARS/cimis-mobile/teams",
			 "hooks_url": "https://api.github.com/repos/CSTARS/cimis-mobile/hooks",
			 "issue_events_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/CSTARS/cimis-mobile/events",
			 "assignees_url": "https://api.github.com/repos/CSTARS/cimis-mobile/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/CSTARS/cimis-mobile/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/CSTARS/cimis-mobile/tags",
			 "blobs_url": "https://api.github.com/repos/CSTARS/cimis-mobile/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/CSTARS/cimis-mobile/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/CSTARS/cimis-mobile/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/CSTARS/cimis-mobile/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/CSTARS/cimis-mobile/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/CSTARS/cimis-mobile/languages",
			 "stargazers_url": "https://api.github.com/repos/CSTARS/cimis-mobile/stargazers",
			 "contributors_url": "https://api.github.com/repos/CSTARS/cimis-mobile/contributors",
			 "subscribers_url": "https://api.github.com/repos/CSTARS/cimis-mobile/subscribers",
			 "subscription_url": "https://api.github.com/repos/CSTARS/cimis-mobile/subscription",
			 "commits_url": "https://api.github.com/repos/CSTARS/cimis-mobile/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/CSTARS/cimis-mobile/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/CSTARS/cimis-mobile/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/CSTARS/cimis-mobile/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/CSTARS/cimis-mobile/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/CSTARS/cimis-mobile/merges",
			 "archive_url": "https://api.github.com/repos/CSTARS/cimis-mobile/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/CSTARS/cimis-mobile/downloads",
			 "issues_url": "https://api.github.com/repos/CSTARS/cimis-mobile/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/CSTARS/cimis-mobile/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/CSTARS/cimis-mobile/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/CSTARS/cimis-mobile/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/CSTARS/cimis-mobile/labels{/name}",
			 "releases_url": "https://api.github.com/repos/CSTARS/cimis-mobile/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/CSTARS/cimis-mobile/deployments",
			 "created_at": "2014-08-12T15:54:51Z",
			 "updated_at": "2016-11-07T21:26:02Z",
			 "pushed_at": "2017-02-09T23:23:46Z",
			 "git_url": "git://github.com/CSTARS/cimis-mobile.git",
			 "ssh_url": "git@github.com:CSTARS/cimis-mobile.git",
			 "clone_url": "https://github.com/CSTARS/cimis-mobile.git",
			 "svn_url": "https://github.com/CSTARS/cimis-mobile",
			 "homepage": null,
			 "size": 9992,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": "JavaScript",
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": false,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 5,
			 "forks": 0,
			 "open_issues": 5,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "The CIMIS data has been updated to include more information in the station.csv data.  In particular, for example; http://cimis.casil.ucdavis.edu/cimis/2016/12/07/station.csv includes all data required by the ring buffer.   The cron job for the ring buffer needs to download the csv files, and add a new set of values.  Let's say ST006 for Davis (st_number 6)  The data them selves have the GIS location if we  don't want to store seperately.  but we can do that too.\r\n"
	 },
	 {
		 "url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/1",
		 "repository_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine",
		 "labels_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/1/labels{/name}",
		 "comments_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/1/comments",
		 "events_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/1/events",
		 "html_url": "https://github.com/ssj-delta-cu/EarthEngine/issues/1",
		 "id": 181531169,
		 "number": 1,
		 "title": "Transfer of assets to shared EarthEngine account",
		 "user": {
			 "login": "andybell",
			 "id": 7776675,
			 "avatar_url": "https://avatars2.githubusercontent.com/u/7776675?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/andybell",
			 "html_url": "https://github.com/andybell",
			 "followers_url": "https://api.github.com/users/andybell/followers",
			 "following_url": "https://api.github.com/users/andybell/following{/other_user}",
			 "gists_url": "https://api.github.com/users/andybell/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/andybell/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/andybell/subscriptions",
			 "organizations_url": "https://api.github.com/users/andybell/orgs",
			 "repos_url": "https://api.github.com/users/andybell/repos",
			 "events_url": "https://api.github.com/users/andybell/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/andybell/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [
			 {
				 "id": 456517791,
				 "url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/labels/enhancement",
				 "name": "enhancement",
				 "color": "84b6eb",
				 "default": true
			 }
		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 7,
		 "created_at": "2016-10-06T21:31:30Z",
		 "updated_at": "2016-10-24T20:28:55Z",
		 "closed_at": null,
		 "repository": {
			 "id": 70194441,
			 "name": "EarthEngine",
			 "full_name": "ssj-delta-cu/EarthEngine",
			 "owner": {
				 "login": "ssj-delta-cu",
				 "id": 14620596,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/14620596?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/ssj-delta-cu",
				 "html_url": "https://github.com/ssj-delta-cu",
				 "followers_url": "https://api.github.com/users/ssj-delta-cu/followers",
				 "following_url": "https://api.github.com/users/ssj-delta-cu/following{/other_user}",
				 "gists_url": "https://api.github.com/users/ssj-delta-cu/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/ssj-delta-cu/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/ssj-delta-cu/subscriptions",
				 "organizations_url": "https://api.github.com/users/ssj-delta-cu/orgs",
				 "repos_url": "https://api.github.com/users/ssj-delta-cu/repos",
				 "events_url": "https://api.github.com/users/ssj-delta-cu/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/ssj-delta-cu/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": true,
			 "html_url": "https://github.com/ssj-delta-cu/EarthEngine",
			 "description": "Scripts from Earth Engine https://earthengine.googlesource.com/ssj-delta-cu",
			 "fork": false,
			 "url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine",
			 "forks_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/forks",
			 "keys_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/teams",
			 "hooks_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/hooks",
			 "issue_events_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/events",
			 "assignees_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/tags",
			 "blobs_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/languages",
			 "stargazers_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/stargazers",
			 "contributors_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/contributors",
			 "subscribers_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/subscribers",
			 "subscription_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/subscription",
			 "commits_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/merges",
			 "archive_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/downloads",
			 "issues_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/labels{/name}",
			 "releases_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/ssj-delta-cu/EarthEngine/deployments",
			 "created_at": "2016-10-06T21:26:02Z",
			 "updated_at": "2016-10-06T21:26:02Z",
			 "pushed_at": "2016-10-06T21:26:02Z",
			 "git_url": "git://github.com/ssj-delta-cu/EarthEngine.git",
			 "ssh_url": "git@github.com:ssj-delta-cu/EarthEngine.git",
			 "clone_url": "https://github.com/ssj-delta-cu/EarthEngine.git",
			 "svn_url": "https://github.com/ssj-delta-cu/EarthEngine",
			 "homepage": null,
			 "size": 0,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": null,
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": false,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 1,
			 "forks": 0,
			 "open_issues": 1,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "Assets for the ssj-delta-cu project need to copied over to the shared earth engine account (ucd.cws.ee.data@gmail.com). \n\nThis should be easy to do with `earthengine cp users/username/asset_id users/username/new_asset_id` in the earth engine command line tool. \n"
	 },
	 {
		 "url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/5",
		 "repository_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric",
		 "labels_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/5/labels{/name}",
		 "comments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/5/comments",
		 "events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/5/events",
		 "html_url": "https://github.com/ssj-delta-cu/ssj-ucd-metric/issues/5",
		 "id": 166668584,
		 "number": 5,
		 "title": "METRIC Processing Status",
		 "user": {
			 "login": "NadyaAlexander",
			 "id": 14622671,
			 "avatar_url": "https://avatars0.githubusercontent.com/u/14622671?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/NadyaAlexander",
			 "html_url": "https://github.com/NadyaAlexander",
			 "followers_url": "https://api.github.com/users/NadyaAlexander/followers",
			 "following_url": "https://api.github.com/users/NadyaAlexander/following{/other_user}",
			 "gists_url": "https://api.github.com/users/NadyaAlexander/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/NadyaAlexander/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/NadyaAlexander/subscriptions",
			 "organizations_url": "https://api.github.com/users/NadyaAlexander/orgs",
			 "repos_url": "https://api.github.com/users/NadyaAlexander/repos",
			 "events_url": "https://api.github.com/users/NadyaAlexander/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/NadyaAlexander/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [

		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 },
			 {
				 "login": "josue-medellin",
				 "id": 13739372,
				 "avatar_url": "https://avatars3.githubusercontent.com/u/13739372?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/josue-medellin",
				 "html_url": "https://github.com/josue-medellin",
				 "followers_url": "https://api.github.com/users/josue-medellin/followers",
				 "following_url": "https://api.github.com/users/josue-medellin/following{/other_user}",
				 "gists_url": "https://api.github.com/users/josue-medellin/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/josue-medellin/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/josue-medellin/subscriptions",
				 "organizations_url": "https://api.github.com/users/josue-medellin/orgs",
				 "repos_url": "https://api.github.com/users/josue-medellin/repos",
				 "events_url": "https://api.github.com/users/josue-medellin/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/josue-medellin/received_events",
				 "type": "User",
				 "site_admin": false
			 },
			 {
				 "login": "jamorande",
				 "id": 20347474,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/20347474?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/jamorande",
				 "html_url": "https://github.com/jamorande",
				 "followers_url": "https://api.github.com/users/jamorande/followers",
				 "following_url": "https://api.github.com/users/jamorande/following{/other_user}",
				 "gists_url": "https://api.github.com/users/jamorande/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/jamorande/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/jamorande/subscriptions",
				 "organizations_url": "https://api.github.com/users/jamorande/orgs",
				 "repos_url": "https://api.github.com/users/jamorande/repos",
				 "events_url": "https://api.github.com/users/jamorande/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/jamorande/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 4,
		 "created_at": "2016-07-20T20:01:02Z",
		 "updated_at": "2016-07-31T03:45:52Z",
		 "closed_at": null,
		 "repository": {
			 "id": 55649496,
			 "name": "ssj-ucd-metric",
			 "full_name": "ssj-delta-cu/ssj-ucd-metric",
			 "owner": {
				 "login": "ssj-delta-cu",
				 "id": 14620596,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/14620596?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/ssj-delta-cu",
				 "html_url": "https://github.com/ssj-delta-cu",
				 "followers_url": "https://api.github.com/users/ssj-delta-cu/followers",
				 "following_url": "https://api.github.com/users/ssj-delta-cu/following{/other_user}",
				 "gists_url": "https://api.github.com/users/ssj-delta-cu/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/ssj-delta-cu/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/ssj-delta-cu/subscriptions",
				 "organizations_url": "https://api.github.com/users/ssj-delta-cu/orgs",
				 "repos_url": "https://api.github.com/users/ssj-delta-cu/repos",
				 "events_url": "https://api.github.com/users/ssj-delta-cu/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/ssj-delta-cu/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": false,
			 "html_url": "https://github.com/ssj-delta-cu/ssj-ucd-metric",
			 "description": "UCD Metric ET calculations.",
			 "fork": false,
			 "url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric",
			 "forks_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/forks",
			 "keys_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/teams",
			 "hooks_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/hooks",
			 "issue_events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/events",
			 "assignees_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/tags",
			 "blobs_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/languages",
			 "stargazers_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/stargazers",
			 "contributors_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/contributors",
			 "subscribers_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/subscribers",
			 "subscription_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/subscription",
			 "commits_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/merges",
			 "archive_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/downloads",
			 "issues_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/labels{/name}",
			 "releases_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-ucd-metric/deployments",
			 "created_at": "2016-04-06T23:55:06Z",
			 "updated_at": "2017-01-26T23:13:10Z",
			 "pushed_at": "2017-03-20T20:25:20Z",
			 "git_url": "git://github.com/ssj-delta-cu/ssj-ucd-metric.git",
			 "ssh_url": "git@github.com:ssj-delta-cu/ssj-ucd-metric.git",
			 "clone_url": "https://github.com/ssj-delta-cu/ssj-ucd-metric.git",
			 "svn_url": "https://github.com/ssj-delta-cu/ssj-ucd-metric",
			 "homepage": null,
			 "size": 10,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": "Makefile",
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": false,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 3,
			 "forks": 0,
			 "open_issues": 3,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "Hi @qjhart and @jamorande,\n\nI am expecting to work until August 13th, but there is a possibility that I could go in for a C-section any day between now and then.\n\nIn order to facilitate our workflow with the current METRIC project, I am going to create a status diary here that I will update whenever new work is done. The purpose of the diary will be to give an update of where I am with all image processing, where the inputs and results are, what data is final, and what data is incomplete. These information might not be obvious looking through the folders in Kaweah, so I want to create a record here.\n\nIf I do have to take leave unexpectedly before we finish processing the water year for the SSJ-BD project Andres you will be responsible for running METRIC. I will write you a procedure today and tomorrow and it will be very straightforward - between Quinn's work with Model 1 and my modifications to the spreadsheet, the directions will be very easy to follow. Quinn will be able to assist you with the hot and cold pixel selector and other pieces of code that he has built.\n"
	 },
	 {
		 "url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/3",
		 "repository_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse",
		 "labels_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/3/labels{/name}",
		 "comments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/3/comments",
		 "events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/3/events",
		 "html_url": "https://github.com/ssj-delta-cu/ssj-landuse/issues/3",
		 "id": 164969483,
		 "number": 3,
		 "title": "Create a tif version of the landcover, assign proper numbers for the data.",
		 "user": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "labels": [

		 ],
		 "state": "open",
		 "locked": false,
		 "assignee": {
			 "login": "qjhart",
			 "id": 344953,
			 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
			 "gravatar_id": "",
			 "url": "https://api.github.com/users/qjhart",
			 "html_url": "https://github.com/qjhart",
			 "followers_url": "https://api.github.com/users/qjhart/followers",
			 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
			 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
			 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
			 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
			 "organizations_url": "https://api.github.com/users/qjhart/orgs",
			 "repos_url": "https://api.github.com/users/qjhart/repos",
			 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
			 "received_events_url": "https://api.github.com/users/qjhart/received_events",
			 "type": "User",
			 "site_admin": false
		 },
		 "assignees": [
			 {
				 "login": "qjhart",
				 "id": 344953,
				 "avatar_url": "https://avatars1.githubusercontent.com/u/344953?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/qjhart",
				 "html_url": "https://github.com/qjhart",
				 "followers_url": "https://api.github.com/users/qjhart/followers",
				 "following_url": "https://api.github.com/users/qjhart/following{/other_user}",
				 "gists_url": "https://api.github.com/users/qjhart/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/qjhart/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/qjhart/subscriptions",
				 "organizations_url": "https://api.github.com/users/qjhart/orgs",
				 "repos_url": "https://api.github.com/users/qjhart/repos",
				 "events_url": "https://api.github.com/users/qjhart/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/qjhart/received_events",
				 "type": "User",
				 "site_admin": false
			 }
		 ],
		 "milestone": null,
		 "comments": 4,
		 "created_at": "2016-07-12T00:32:55Z",
		 "updated_at": "2016-08-12T16:56:18Z",
		 "closed_at": null,
		 "repository": {
			 "id": 57926175,
			 "name": "ssj-landuse",
			 "full_name": "ssj-delta-cu/ssj-landuse",
			 "owner": {
				 "login": "ssj-delta-cu",
				 "id": 14620596,
				 "avatar_url": "https://avatars0.githubusercontent.com/u/14620596?v=3",
				 "gravatar_id": "",
				 "url": "https://api.github.com/users/ssj-delta-cu",
				 "html_url": "https://github.com/ssj-delta-cu",
				 "followers_url": "https://api.github.com/users/ssj-delta-cu/followers",
				 "following_url": "https://api.github.com/users/ssj-delta-cu/following{/other_user}",
				 "gists_url": "https://api.github.com/users/ssj-delta-cu/gists{/gist_id}",
				 "starred_url": "https://api.github.com/users/ssj-delta-cu/starred{/owner}{/repo}",
				 "subscriptions_url": "https://api.github.com/users/ssj-delta-cu/subscriptions",
				 "organizations_url": "https://api.github.com/users/ssj-delta-cu/orgs",
				 "repos_url": "https://api.github.com/users/ssj-delta-cu/repos",
				 "events_url": "https://api.github.com/users/ssj-delta-cu/events{/privacy}",
				 "received_events_url": "https://api.github.com/users/ssj-delta-cu/received_events",
				 "type": "Organization",
				 "site_admin": false
			 },
			 "private": true,
			 "html_url": "https://github.com/ssj-delta-cu/ssj-landuse",
			 "description": "Delta Landuse and Landcover Maps",
			 "fork": false,
			 "url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse",
			 "forks_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/forks",
			 "keys_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/keys{/key_id}",
			 "collaborators_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/collaborators{/collaborator}",
			 "teams_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/teams",
			 "hooks_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/hooks",
			 "issue_events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/events{/number}",
			 "events_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/events",
			 "assignees_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/assignees{/user}",
			 "branches_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/branches{/branch}",
			 "tags_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/tags",
			 "blobs_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/git/blobs{/sha}",
			 "git_tags_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/git/tags{/sha}",
			 "git_refs_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/git/refs{/sha}",
			 "trees_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/git/trees{/sha}",
			 "statuses_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/statuses/{sha}",
			 "languages_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/languages",
			 "stargazers_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/stargazers",
			 "contributors_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/contributors",
			 "subscribers_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/subscribers",
			 "subscription_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/subscription",
			 "commits_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/commits{/sha}",
			 "git_commits_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/git/commits{/sha}",
			 "comments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/comments{/number}",
			 "issue_comment_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues/comments{/number}",
			 "contents_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/contents/{+path}",
			 "compare_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/compare/{base}...{head}",
			 "merges_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/merges",
			 "archive_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/{archive_format}{/ref}",
			 "downloads_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/downloads",
			 "issues_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/issues{/number}",
			 "pulls_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/pulls{/number}",
			 "milestones_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/milestones{/number}",
			 "notifications_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/notifications{?since,all,participating}",
			 "labels_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/labels{/name}",
			 "releases_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/releases{/id}",
			 "deployments_url": "https://api.github.com/repos/ssj-delta-cu/ssj-landuse/deployments",
			 "created_at": "2016-05-02T22:50:47Z",
			 "updated_at": "2016-05-12T20:09:57Z",
			 "pushed_at": "2016-08-12T16:54:11Z",
			 "git_url": "git://github.com/ssj-delta-cu/ssj-landuse.git",
			 "ssh_url": "git@github.com:ssj-delta-cu/ssj-landuse.git",
			 "clone_url": "https://github.com/ssj-delta-cu/ssj-landuse.git",
			 "svn_url": "https://github.com/ssj-delta-cu/ssj-landuse",
			 "homepage": null,
			 "size": 22903,
			 "stargazers_count": 0,
			 "watchers_count": 0,
			 "language": "Makefile",
			 "has_issues": true,
			 "has_downloads": true,
			 "has_wiki": true,
			 "has_pages": false,
			 "forks_count": 0,
			 "mirror_url": null,
			 "open_issues_count": 4,
			 "forks": 0,
			 "open_issues": 4,
			 "watchers": 0,
			 "default_branch": "master"
		 },
		 "body": "We have the landuse vector product.  It would be nice to have a a common geotiff version, using the standard UTM tif format that matches the landsat imagery.   This also needs to have standard numbering so we can find things like alfalfa.\n"
	 }
 ]
#+end_example
